In [13]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite:///cssys.db

In [6]:
%%sql
CREATE TABLE students (
    id INTEGER,
    firstname CHAR(15),
    lastname CHAR(15),
    age INTEGER,
    gender CHAR(1),
    gpa DOUBLE,
    PRIMARY KEY (id)
);

 * sqlite:///cssys.db
Done.

[]

In [7]:
%%sql
CREATE TABLE courses (
    id INTEGER,
    name CHAR(15),
    credit INTEGER,
    prereq INTEGER,
    PRIMARY KEY (id, prereq)
);

 * sqlite:///cssys.db
Done.

[]

In [8]:
ALTER TABLE students RENAME COLUMN age TO Date of Birth (dob);

SyntaxError: invalid syntax (25289576.py, line 1)

In [10]:
%%sql 
ALTER TABLE students RENAME COLUMN age TO dob;

 * sqlite:///cssys.db
Done.

[]

In [37]:
%%sql
INSERT INTO students(id, firstname, lastname, dob, gender, gpa)
VALUES  (1001, 'adam', 'smith', 03, 'm', 3.1),
        (1002, 'alice', 'frank', 11, 'f' , 3.4),
        (1003, 'bob', 'hal', 01, 'm', 2);

 * sqlite:///bank.db
   sqlite:///cssys.db
(sqlite3.OperationalError) no such table: students
[SQL: INSERT INTO students(id, firstname, lastname, dob, gender, gpa)
VALUES  (1001, 'adam', 'smith', 03, 'm', 3.1),
        (1002, 'alice', 'frank', 11, 'f' , 3.4),
        (1003, 'bob', 'hal', 01, 'm', 2);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [19]:
%%sql
SELECT * FROM students;

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', 3, 'm', 3.1),
 (1002, 'alice', 'frank', 11, 'f', 3.4),
 (1003, 'bob', 'hal', 1, 'm', 2.0)]

In [20]:
%%sql
INSERT INTO courses (id, name, credit, prereq)
VALUES  (100, 'programming', 3, NULL),
        (110, 'math', 3, NULL),
        (120, 'web', 4, NULL),
        (301, 'networking', 4, 200),
        (301, 'networking', 4, 150),
        (301, 'networking', 4, 210),
        (354, 'database', 3, 120),
        (354, 'database', 3, 110),
        (360, 'os', 3, 150),
        (360, 'os', 3, 210);

 * sqlite:///cssys.db
10 rows affected.

[]

In [21]:
%%sql
SELECT * FROM courses;

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (120, 'web', 4, None),
 (301, 'networking', 4, 200),
 (301, 'networking', 4, 150),
 (301, 'networking', 4, 210),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

In [29]:
%%sql
INSERT INTO transcript (studentid, courseid, mark, semester, credit)
VALUES 
        (1001, 100, 3, 202201, 3),
        (1001, 110, 3.5, 202201, 3),
        (1001, 120, 2.7, 202201, 4),
        (1001, 301, 3.4, 202202, 4),
        (1002, 100, 3, 201801, 3),
        (1002, 110, 3.2, 202301, 3),
        (1002, 301, 3.1, 202302, 4),
        (1003, 100, 2.5, 202201, 3),
        (1003, 120, 3.5, 202301, 4),
        (1003, 301, 2.8, 202302, 4),
        (1003, 354, 4, 202303, 3),
        (1003, 360, 3.5, 202202, 3);
SELECT * FROM transcript;

 * sqlite:///cssys.db
(sqlite3.IntegrityError) UNIQUE constraint failed: transcript.studentid, transcript.courseid
[SQL: INSERT INTO transcript (studentid, courseid, mark, semester, credit)
VALUES
        (1001, 100, 3, 202201, 3),
        (1001, 110, 3.5, 202201, 3),
        (1001, 120, 2.7, 202201, 4),
        (1001, 301, 3.4, 202202, 4),
        (1002, 100, 3, 201801, 3),
        (1002, 110, 3.2, 202301, 3),
        (1002, 301, 3.1, 202302, 4),
        (1003, 100, 2.5, 202201, 3),
        (1003, 120, 3.5, 202301, 4),
        (1003, 301, 2.8, 202302, 4),
        (1003, 354, 4, 202303, 3),
        (1003, 360, 3.5, 202202, 3);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [33]:
%%sql
SELECT * 
FROM courses
WHERE credit = 3

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

In [34]:
%%sql
SELECT firstname, lastname, gpa
FROM students
ORDER BY gpa ASC

 * sqlite:///cssys.db
Done.

[('bob', 'hal', 2.0), ('adam', 'smith', 3.1), ('alice', 'frank', 3.4)]

In [36]:
%sql sqlite:///bank.db

In [38]:
SELECT * FROM bank;

SyntaxError: invalid syntax (3195823039.py, line 1)

In [1]:
%%sql
SELECT * FROM bank;

UsageError: Cell magic `%%sql` not found.

In [6]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('bank.db')

# Create a cursor object to execute SQL queries
cursor = conn.cursor()

# Example: Fetch all rows from a table
cursor.execute('SELECT * FROM bank')
rows = cursor.fetchall()

# Display the fetched data
for row in rows:
    print(row)

# Close the connection
conn.close()

OperationalError: no such table: bank

In [10]:
%%sql 
CREATE TABLE bank

Traceback (most recent call last):
  File "C:\Users\nguye\anaconda3\Lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\nguye\anaconda3\Lib\site-packages\sql\connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [8]:
conn = sqlite3.connect('C:/Users/nguye/bank.db')

In [14]:
%%sql 
CREATE TABLE bank 
# Create a cursor object to execute SQL queries
cursor = conn.cursor()

# Example: Fetch all rows from a table
cursor.execute('SELECT * FROM bank')
rows = cursor.fetchall()

# Display the fetched data
for row in rows:
    print(row)

# Close the connection
conn.close()

Traceback (most recent call last):
  File "C:\Users\nguye\anaconda3\Lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\nguye\anaconda3\Lib\site-packages\sql\connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])